{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20250716-use-duckdb-and-parquet-files-for-data-storage","package":null,"title":"Use DuckDB & Parquet Files for Data Storage","status":"superseded","supersededBy":{"slug":"20260210-use-encrypted-duckdb-files-for-data-storage","package":null,"title":"Use Encrypted DuckDB Files for Data Storage","status":"draft","creationDate":"2026-02-11T03:58:38.000Z","publicationDate":"2026-02-11T07:59:59.000Z"},"tags":["backend","security"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nThe desktop wallet requires the user's data (e.g. account keys, settings, dApp connect sessions) to be stored somewhere on their device.\n\n## Decision Drivers\n\n- **Encryption**: Almost all of the data files need to be encrypted to ensure privacy ([THREAT-023](../threat-model/01-threats.md#threat-023-exposure-of-sensitive-or-secret-data-within-desktop-wallet-files)) and prevent tampering ([THREAT-012](../threat-model/01-threats.md#threat-012-modifying-security-settings-in-configuration-files)). The algorithm used to encrypt the files must be strong enough to make it very hard to crack offline ([THREAT-011](../threat-model/01-threats.md#threat-011-cracking-encryption-on-wallet-files-offline)).\n- **Portability**: The data storage solution must be able to be embedded into the desktop wallet software and store data into files that can be easily moved and backed up\n- **Go library/SDK**: The data storage solution must be able to be used in Go, preferably without requiring CGo to be enabled\n\n## Considered Options\n\n- DuckDB with Parquet files\n- DuckDB with DuckDB database files\n- SQLite\n- DuckLake\n\n## Decision Outcome\n\nChose to use DuckDB with Parquet files. DuckDB is a lightweight database that can easily be embedded using Go. Using DuckDB with Parquet files should provide easy support for encrypting whole data files. The robust support for encrypting a whole Parquet file is the primary reason for using DuckDB with Parquet files instead of the other options.\n\n**Confidence**: (2026-01-14) Medium. DuckDB seems to work well for small number of wallets and accounts. Further testing is needed.\n\n~~**Confidence**: Low. DuckDB is not designed for use cases similar to this project's use case. If using DuckDB fails, then SQLite will have to be used.~~\n\n### Positive Consequences\n\n- More privacy through the encryption of the entire data files\n- Data files will be tamper resistant because they are encrypted\n\n### Negative Consequences\n\n- A \"driver\" for KMD must be created for it to use DuckDB with Parquet files instead of SQLite\n- Accessing the data within the files may be significantly slower because they are encrypted\n- Must enable CGo. Fortunately, the [Go SQL Driver For DuckDB](https://github.com/marcboeker/go-duckdb) provides instructions on how to install GCC in Windows.\n\n## Pros and Cons of the Options\n\n### DuckDB with Parquet Files\n\n[DuckDB](https://duckdb.org/) is an small in-process database designed for analytics. It can read and write [Parquet](https://duckdb.org/docs/stable/data/parquet/overview) files directly.\n\n- Pro: The name is duck themed 🦆\n- Pro: Small and in-process like SQLite, making it very portable\n- Pro: An entire Parquet file does not need to be loaded into memory to read it, even when the file is encrypted\n- Pro: The Parquet file format is independent from DuckDB, so any Parquet file reader that supports encryption can read the files. The Parquet file encryption mechanism is part of the [specification](https://github.com/apache/parquet-format/blob/master/Encryption.md) and is [supported by DuckDB](https://duckdb.org/docs/stable/data/parquet/encryption) out of the box.\n- Pro: [Client in Go (Go SQL Driver For DuckDB)](https://github.com/marcboeker/go-duckdb) is officially supported. Unfortunately, it requires CGo.\n- Con: Not as common, so there is less support and documentation available. However, the documentation on the [official website](https://duckdb.org/docs/stable/) is good.\n- Con: DuckDB is a columnar OLAP (OnLine Analytical Processing) database that is designed for analytics, not for simple storing and retrieval of single rows in a table. However, its capability to handle data analysis may come in handy for certain features in the future.\n- Con: Cannot easily add to, delete from or update an item within a Parquet file. Entire file needs to be read and then written to a new file. This is fine as long as the data files remain small, but it will become a performance bottleneck if one or more data files becomes large.\n- Con: A new KMD \"driver\" needs to be created for KMD to use DuckDB instead of SQLite\n- Con: More files to manage. Unlike SQLite where all the wallet data is stored one database file, using the Parquet file format would require more files for the same data. This is because a Parquet file can store only one table.\n\n### DuckDB with DuckDB Database Files\n\n[DuckDB](https://duckdb.org/) is an small in-process database designed for analytics. It has its own native database format.\n\n- Pro: The name is duck themed 🦆\n- Pro: Fast for analytics, but analytics is not this project's use case\n- Con: DuckDB database files do not support encryption\n- Con: Offers no significant advantage over SQLite for this project's use case\n\n### SQLite\n\n[SQLite](https://sqlite.org/index.html) is an in-process database. It is the most popular database and is embedded in a variety of devices and environments.\n\n- Pro: Widely supported with plenty of documentation and tutorials\n- Pro: Small and in-process, which makes it very portable\n- Pro: Already used in KMD, which makes it easier to expand for other uses (e.g. storing dApp connect session data)\n- Pro: More efficient at adding, deleting and updating data\n- Pro: Multiple tables can be placed into one `.db` file, which is more convenient for moving or backing up data\n- Pro: There is a [Go SQLite Driver](https://pkg.go.dev/modernc.org/sqlite) that does not require CGo\n- Con: Encrypting whole file is not easily supported. It requires installing an [extension](https://github.com/utelle/SQLite3MultipleCiphers) that would have to be managed separately.\n- Con: Data compression is not easily supported, which can become a problem as more data is stored\n\n### DuckLake\n\n[DuckLake](https://ducklake.select/) is an integrated data lake and catalog format, where a database is used to catalog and track the Parquet files within a data lake (a bunch of data files stored together somewhere).\n\n- Pro: The name is duck themed 🦆\n- Pro: Deletes, inserts and updates within Parquet files are handled by DuckLake, unlike with plain DuckDB with Parquet files where changes to a Parquet file require the whole file to be replaced\n- Pro: Utilizes DuckDB and Parquet files\n- Pro: Supports encryption\n- Con: Cannot set key used for encryption (a random key is generated for each Parquet file)\n- Con: Requires using \"snapshots\", which would create more bloat for this project's use case\n- Con: Designed to be used for massive amounts of data, which does not fit this project's use case\n\n## Links\n\n- Supersedes <AdrLink slug=\"20240103-use-sqlite-database-to-store-keys\" status=\"superseded\" title=\"Use SQLite Database to Store Keys\" customLabel=\"Use SQLite Database to Store Keys\" />\n- Related to <AdrLink slug=\"20240102-use-local-server-to-connect-to-dapps\" status=\"accepted\" title=\"Use Local Server to Connect to DApps\" customLabel=\"Use Local Server to Connect to DApps\" />\n- [Types of DBMS and Databases: Advantages, Limitations, and Best Applications - altexsoft](https://www.altexsoft.com/blog/databases-database-management-systems/)\n- [Deep Dive into DuckDB with CTO Mark Raasveldt](https://www.youtube.com/watch?v=f9QlkXW4H9A)\n"},"creationDate":"2025-07-16T21:57:29.000Z","lastEditDate":"2026-02-11T03:58:38.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2025-07-17T06:59:59.000Z","file":{"relativePath":"docs/decisions/20250716-use-duckdb-and-parquet-files-for-data-storage.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20250716-use-duckdb-and-parquet-files-for-data-storage.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20250716-use-duckdb-and-parquet-files-for-data-storage.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}