{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20250619-dapp-connect-protocol","package":null,"title":"DApp Connect Protocol","status":"draft","supersededBy":null,"tags":["dapp-connect","security","backend"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nFor the user to be able to interact with a dApp using the desktop wallet, the dApp must be able to connect with the wallet to securely send and receive data from the wallet. A protocol needs to be established between the dApp and the desktop wallet's <AdrLink slug=\"20240102-use-local-server-to-connect-to-dapps\" status=\"accepted\" title=\"Use Local Server to Connect to DApps\" customLabel=\"dApp connect server on localhost\" />. Each dApp (or dApp instance) must be able to identify itself to the server and confirm its unique identity.\n\n## Decision Drivers\n\n- Includes the decision drivers for the <AdrLink slug=\"20240821-use-hawk-for-dapp-connection-authentication-and-authorization\" status=\"accepted\" title=\"Use Hawk for DApp Connection Authentication and Authorization\" customLabel=\"decision to use Hawk\" />\n- **DApp connect session management:** The dApp connect protocol needs to be able to (1) establish a session between a dApp and the desktop wallet, (2) let dApps end their sessions, (3) let the server end any session, and (4) let the server receive and store information about connected dApps\n- **Known related threats:** [THREAT-009](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server), [THREAT-010](../threat-model/01-threats.md#threat-010-wallet-connection-server-overwhelmed-by-too-many-requests-or-requests-that-are-too-large), [THREAT-012](../threat-model/01-threats.md#threat-012-modifying-security-settings-in-configuration-files), [THREAT-013](../threat-model/01-threats.md#threat-013-wallet-password-is-written-down-and-stored-in-insecure-location), [THREAT-022](../threat-model/01-threats.md#threat-022-multiple-dapps-establishing-connect-sessions-with-the-same-dapp-id)\n- **User experience (UX):** Asking the user to enter their password too frequently degrades UX. The user needs to be presented with relevant information for making an informed decision when approving and when ending a session.\n- **Session data stored in encrypted file(s):** The session data being stored in an encrypted file imposes constraints that affect UX because the user's wallet password would be needed to decrypt and access the session data. This problem is lessened by the fact that the wallet password is typically stored in memory while the wallet is unlocked and open.\n\n## Considered Options\n\n- Iteration 4: Mitigate [THREAT-009](./threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server) by requiring a \"confirmation code\", revert use of approvals and session tokens, remove session renewal\n- Iteration 3: Authentication using short sessions with long \"approval\"\n- Iteration 2: Mitigate [THREAT-022](../threat-model/01-threats.md#threat-022-multiple-dapps-establishing-connect-sessions-with-the-same-dapp-id), allow session to end if server is offline, add session \"ping\"\n- Iteration 1: Simplest iteration\n\n## Decision Outcome\n\nChose Iteration 4. It strikes the right balance between security and UX.\n\n**Confidence**: Low. Despite this protocol being inspired by other protocols like OAuth, it is uncertain if this protocol is too complex for dApps. There may be some unknown security vulnerabilities lurking within this protocol.\n\n### Positive Consequences\n\n- No secret data is transmitted unencrypted\n- A dApp that is not web-based can authenticate and interact with the desktop wallet\n- The user immediately knows when a dApp is trying to connect to the wallet\n\n### Negative Consequences\n\n- The dApp must be able to generate and store a secret key securely, which can be a problem for web dApps in a browser\n- This protocol adds more parts and moving pieces to the desktop wallet, which increases the attack surface of the wallet. There may be some unknown or unforeseen threats lurking in this protocol.\n\n## Pros and Cons of the Options\n\n### Iteration 4\n\nThis is the fourth attempt at designing the dApp connect protocol. In this iteration, session renewal and the use of session tokens were dropped. Instead of session tokens, there are single-use session confirmation tokens that are used for the checking the \"confirmation code\" when confirming a session. Parts from the [first](#iteration-1) and [second](#iteration-2) iterations were combined to make a simpler protocol compared to the [third iteration](#iteration-3).\n\n#### Iteration 4: Establishing a Session\n\nLike with the [second](#iteration-2-establishing-a-session) and [third](#iteration-2-establishing-a-session) iterations, establishing a session consists of initializing the session and then confirming it. However, confirming the session requires the user to enter a \"confirmation code\", displayed by the dApp, into the wallet's UI. This mitigates the threat of the Diffie-Hellman (DH) Man-in-the-Middle (MitM) attack ([THREAT-009](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server)) that was present int the previous iterations.\n\nThere is no session token, unlike [Iteration 3](#iteration-3-establishing-a-session). Instead, there is a single-use \"confirmation token\". The confirmation token is used check the confirmation code entered by the user. This way, tokens are [used in the way in which they are most suited](http://cryto.net/~joepie91/blog/2016/06/13/stop-using-jwt-for-sessions/).\n\n1. **Initialize session**\n   1. DApp: Generate dApp key pair (dApp ID & dApp secret key)\n   2. DApp → Server: Send request to `/session/init`, providing dApp ID\n   3. Server: Validate received dApp ID\n   4. Server: Generate confirmation key pair (confirmation ID + confirmation secret key) and confirmation data (date created, expiration, etc.) and store it into an encrypted database file protected by the user's password\n   5. Server: Generate session key pair (session ID & session secret key).\n      - **Note:** Generating the session key pair and placing it into the confirmation token ensures that a confirmation token is only used once because the server cannot store multiple sessions same session ID. If there is an attempt to use an unexpired confirmation token after it has be used, the server will reject it because it already stores a session with the session ID within the confirmation token.\n   6. Server: Generate a \"confirmation code\"\n   7. Server: Use the confirmation key to create an encrypted \"confirmation token\" in [PASETO](https://paseto.io/) format that contains the dApp ID, session key pair, confirmation data and confirmation code\n   8. Server → DApp: Send authenticated response containing confirmation ID, data, code and token\n   9. DApp: Derive confirmation shared secret key using dApp key and confirmation ID to verify authentication in the server's response\n2. **Confirm session**\n   1. DApp → User: Display confirmation code\n   2. DApp → Server: Send authenticated request to `/session/confirm`, providing dApp data (dApp name, icon, etc.), confirmation token and confirmation ID\n   3. Server: Retrieve confirmation key using given confirmation ID\n   4. Server: Derive confirmation shared key using the confirmation key and dApp ID\n   5. Server: Verify authentication and validate dApp data\n   6. Server: Extract data from confirmation token by decrypting it using confirmation key\n   7. Server → User: *(Through the UI)* Present dApp data and ask for approval of connection to dApp\n   8. User → Server: Approve the connection to dApp by entering password and confirmation code\n   9. Server: Generate session data (date created, expiration, etc.)\n   10. Server: Derive session shared secret key using dApp ID and session key for sending authenticated response\n   11. Server: Store session ID, session shared key, session data, dApp ID and dApp data into an encrypted database file protected by the user's password\n   12. Server → DApp: Send authenticated response containing session ID and session data\n   13. DApp: Derive the shared key using dApp key and session ID to verify authentication in the server's response\n   14. DApp: Store session ID and session data\n\nResult: The dApp can now use the session shared key to send authenticated requests to the server.\n\n#### Iteration 4: Authenticated Request\n\nSame as [Iteration 1](#iteration-1-authenticated-request).\n\n#### Iteration 4: End session from DApp\n\nA dApp can optionally end its session by contacting the server before deleting its stored session data, just like ending a session in [Iteration 1](#iteration-1-end-session-from-dapp). This is most ideal way for a dApp to end the session. However, if the dApp cannot contact the server, deleting its stored session data, like with [Iteration 2](#iteration-2-end-session-from-dapp), is acceptable.\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-4-establishing-a-session).\n\n#### Iteration 4: End Session from Wallet\n\nSame as [Iteration 2](#iteration-2-end-session-from-wallet).\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-4-establishing-a-session).\n\n#### Iteration 4: Renew Session\n\nSession renewal is removed because it is unnecessary. A session does not need to be short because no secret session data is transmitted unencrypted. A session should be able to safely last about 1-2 weeks, which should be long enough to not hurt UX too much.\n\nThis dApp connect protocol is supposed to replace the wallet session protocol used by <AdrLink slug=\"20240217-integrate-kmd-wallet-management-code\" status=\"accepted\" title=\"Integrate KMD Wallet Management Code\" customLabel=\"Algorand's KMD wallet\" />. With KMD, renewing sessions was needed because the \"wallet handle\" a dApp (client) needed to authenticate with the server was always sent in plain text. The ability to renew a wallet handle was a compromise to make it easier to use KMD. However, that renewal feature undermined the security of the KMD wallet session because a malicious actor could steal a wallet handle while it is still valid and renew it.\n\n#### Pros and Cons of Iteration 4\n\n- Pro: The requirement of a confirmation code when establishing a session mitigates threat of the Diffie-Hellman (DH) Man-in-the-Middle (MitM) attack ([THREAT-009](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server))\n- Con: Like with [Iteration 2](#pros-and-cons-of-iteration-2), sessions cannot be very long or very short. Finding the right session length will require some approximation and trial-and-error.\n- Con: Like with [Iteration 2](#pros-and-cons-of-iteration-2), the extra \"ping\" requests from dApps checking their session's validity can lead to a higher chance of the server being overwhelmed ([THREAT-010](../threat-model/01-threats.md#threat-010-wallet-connection-server-overwhelmed-by-too-many-requests-or-requests-that-are-too-large)).\n- Con: More work for a dApp because it needs to provide a way to display the confirmation code to the user.\n\n### Iteration 3\n\nThis is the third attempt at designing the dApp connect protocol. It is supposed to improve upon the [second iteration](#iteration-2) by allowing for short sessions without the user needing to enter their password for a long period of time.\n\n#### Iteration 3: Establishing a Session\n\nLike with the [second iteration](#iteration-2-establishing-a-session), establishing a session consists of initializing the session and then confirming it. Unlike the second iteration, this iteration includes the creation of an \"approval\" during session confirmation. An \"approval\" is data that represents the user's approval of the wallet's connection to a dApp. The server uses the \"approval secret key\" to create an encrypted \"session token\" and gives it to the dApp to use for authentication.\n\nAn approval can last for months while a session can last an hour. When the session expires, the dApp can renew the session and get a new token as long as the approval is valid. This mechanism is similar to [OAuth 2.0 grants](https://oauth.net/2/grant-types/).\n\n1. **Initialize session** - Same as [Iteration 2](#iteration-2-establishing-a-session)\n2. **Confirm session**\n   1. DApp → Server: Send authenticated request to `/session/confirm`, providing dApp data (dApp name, icon, etc.)\n   2. Server: Verify authentication\n   3. Server → User: *(Through the UI)* Present dApp data and ask for approval of connection to dApp\n   4. User → Server: Approve the connection to dApp (by entering password) and send approval\n   5. Server: Generate approval secret key and approval data (approval index, expiration, etc.)\n   6. Server: Store approval key, approval data, dApp ID and dApp data into an encrypted database file protected by the user's password\n   7. Server: Generate session key pair (session ID & session secret key) and session data (date created, expiration, etc.)\n   8. Server: Use the approval key to create an encrypted \"session token\" in the [PASETO](https://paseto.io/) format that contains the dApp ID, session ID, session data and approval index\n   9. Server: Derive session shared secret key using dApp ID and session key or sending authenticated response\n   10. Server → DApp: Send authenticated response containing the token, session ID and session data\n   11. DApp: Derive the session shared key using dApp secret key and session ID to verify authentication in the server's response\n   12. DApp: Store token, session ID, session data and shared key\n\nResult: The dApp can now use the session shared key to send authenticated requests to the server.\n\n#### Iteration 3: Authenticated Request\n\nCertain requests require the dApp to be authenticated.\n\n1. DApp: Use the Hawk authentication scheme to create Hawk header data using session token and shared secret key\n2. DApp → Server: Place the Hawk header data into the request `Authorization` header and send request\n3. Server: Use the approval index (a part of the session token) to retrieve the approval key that will be used to decrypt the session token\n4. Server: Extract the shared session key from the decrypted token data\n5. Server: Verify the authentication of the dApp using the shared key according to the Hawk authentication scheme\n6. Server: Do some stuff\n7. Server → DApp: Send authenticated response\n\nResult: The dApp gets the data it needed from the server.\n\n#### Iteration 3: End session from DApp\n\nSame as [Iteration 2](#iteration-2-end-session-from-dapp).\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-3-establishing-a-session).\n\n#### Iteration 3: End Session from Wallet\n\nSame as [Iteration 1](#iteration-1-end-session-from-wallet). Because sessions are short, the [\"ping\" requests for checking session validity in Iteration 2](#iteration-2-end-session-from-wallet) are unnecessary.\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-3-establishing-a-session).\n\n#### Iteration 3: Renew Session\n\nBefore a session is expired, a dApp can \"renew\" its session to continue being connected to the wallet after the (old) session expiration.\n\n1. DApp → Server: Send authenticated request to `/session/renew`\n2. Server: Decrypt session token and extract data\n3. Server: Verify authentication\n4. Server: Check approval is not expired\n5. Server: Create new session key pair and session data\n6. Server: Derive new session shared secret key using dApp ID and new session key\n7. Server: Create a new token containing the dApp ID, approval index, new session ID, new session data and new shared secret key\n8. Server → DApp: Send authenticated response containing the new token, session ID and session data\n9. DApp: Derive the new session shared key using dApp secret key and new session ID to verify authentication in the server's response\n10. DApp: Store new token, session ID, session data and shared key\n\nResult: The expiration of the session has been extended and the dApp can continue sending authenticated requests.\n\n#### Pros and Cons of Iteration 3\n\n- Pro: Allows for short sessions while not bothering the user asking them to approve the connection frequently\n- Con: Shorter sessions can lead to a higher chance of the server being overwhelmed ([THREAT-010](../threat-model/01-threats.md#threat-010-wallet-connection-server-overwhelmed-by-too-many-requests-or-requests-that-are-too-large)) when too many dApps are renewing their sessions too frequently. Finding the right session length is crucial.\n- Con: When a session expires, the session cannot be renewed and the dApp must establish a new session, starting all over again. This makes the session renewal mechanism essentially useless and defeats the purpose of having this short-session/long-approval scheme. Attempting the [myriad of ways](http://cryto.net/~joepie91/blog/2016/06/19/stop-using-jwt-for-sessions-part-2-why-your-solution-doesnt-work/) of working around this issue leads to more issues or back to the some of the same issues as before, which is why it is said that tokens are [not suited to be used for sessions](http://cryto.net/~joepie91/blog/2016/06/13/stop-using-jwt-for-sessions/).\n- Con: Vulnerable to a Man-in-the-Middle (MitM) attack ([THREAT-009](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server)) that is [common to Diffie-Hellman (DH) protocols](https://asecuritysite.com/dh/diffie_crack) where a malicious actor generates two sets of key pairs to intercept dApp requests and server responses by doing DH key exchanges with both of them.\n\n### Iteration 2\n\nThis is the second attempt at designing the dApp connect protocol. It is supposed to improve upon the [first iteration](#iteration-1) by addressing and fixing its core issues.\n\n#### Iteration 2: Establishing a Session\n\nTo be able to authenticate itself to the server, the dApp must obtain a session shared secret key by establishing a session with the server. To establish a session, the dApp must \"initialize\" the session to get a confirmation ID and then \"confirm\" the session by authenticating itself to the server. In confirming the session, the dApp proves it owns the dApp ID it initially provided to the server.\n\n1. **Initialize session**\n   1. DApp: Generate dApp key pair (dApp ID & dApp secret key)\n   2. DApp → Server: Send request to `/session/init`, providing dApp ID\n   3. Server: Validate received dApp ID\n   4. Server: Generate confirmation key pair (confirmation ID + confirmation secret key) and confirmation data (date created, expiration, etc.)\n   5. Server: Derive confirmation shared secret key using dApp ID and confirmation key\n   6. Server: Store confirmation ID, confirmation shared key and confirmation data into an encrypted database file protected by the user's password\n   7. Server → DApp: Send authenticated response containing confirmation ID and confirmation data\n   8. DApp: Derive confirmation shared key using dApp key and confirmation ID to verify authentication in the server's response\n2. **Confirm session**\n   1. DApp → Server: Send authenticated request to `/session/confirm`, providing dApp data (dApp name, icon, etc.)\n   2. Server: Verify authentication and validate dApp data\n   3. Server → User: *(Through the UI)* Present dApp data and ask for approval of connection to dApp\n   4. User → Server: Approve the connection to dApp (by entering password)\n   5. Server: Generate session key pair (session ID & session secret key) and session data (date created, expiration, etc.)\n   6. Server: Derive session shared secret key using dApp ID and session key\n   7. Server: Store session ID, shared key, session data (date created, expiration, etc.), dApp ID and dApp data into an encrypted database file protected by the user's password\n   8. Server → DApp: Send authenticated response containing session ID and session data\n   9. DApp: Derive the shared key using dApp key and session ID to verify authentication in the server's response\n   10. DApp: Store session ID and session data\n\nResult: The dApp can now use the session shared key to send authenticated requests to the server.\n\n#### Iteration 2: Authenticated Request\n\nSame as [Iteration 1](#iteration-1-authenticated-request).\n\n#### Iteration 2: End session from DApp\n\nThe dApp can end the session before the session expires. Unlike the [first iteration](#iteration-1-end-session-from-dapp), the dApp does not contact the server.\n\n1. DApp: Delete its stored session data (session ID, shared key, etc.)\n2. DApp: *No contact with server*\n3. Server *(Some time later)*: Delete its stored session data because it expired or the session was manually ended from the wallet.\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-2-establishing-a-session).\n\n#### Iteration 2: End Session from Wallet\n\nThe user, through the UI, can command the server to end the session before the session expires. However, the dApp does not immediately know that the session has ended, so it must periodically \"ping\" the server to check if the session is still valid.\n\n1. \\[Optional\\] Session validity check (Valid session)\n   1. DApp → Server: Send authenticated request to `/session/:session_id`\n   2. Server: Verify authentication\n   3. Server: Check if session still exists\n   4. Server → DApp *(session exists)*: Send authenticated response with `200 OK` HTTP code\n   5. DApp: Use session shared key to verify authentication in the server's response\n2. End session\n   1. UI → Server: End session\n   2. Server: Delete session data (date created, expiration, etc.) from session database\n   3. Server → UI: Respond with success\n   4. Server: *No contact with DApp*\n3. \\[Optional\\] Session validity check (Invalid session)\n   1. DApp → Server: Send authenticated request to `/session/:session_id`\n   2. Server: Verify authentication\n   3. Server: Check if session still exists\n   4. Server → DApp *(session does not exist)*: Send authenticated response with `404 Not Found` HTTP code\n   5. DApp: Use session shared key to verify authentication in the server's response\n   6. DApp: Delete stored session data (session ID, shared key, etc.)\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-2-establishing-a-session).\n\n#### Iteration 2: Renew Session\n\nSame as [Iteration 1](#iteration-1-renew-session).\n\n#### Pros and Cons of Iteration 2\n\n- Pro: The server does not have to be online for a dApp to be able to end the session\n- Pro: Mitigates [THREAT-022](../threat-model/01-threats.md#threat-022-multiple-dapps-establishing-connect-sessions-with-the-same-dapp-id). A malicious actor cannot impersonate a dApp simply by using its dApp ID.\n- Con: Sessions cannot be very long because the shared key should be changed frequently to reduce the likelihood of [sensitive data being intercepted (THREAT-009)](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server) and to reduce the damage if the shared key is stolen (because the key can only be used for a short period of time). However, short sessions ruin UX because the user has to connect with password more frequently. Consequently, the user is more likely to store their password insecurely ([THREAT-013](../threat-model/01-threats.md#threat-013-wallet-password-is-written-down-and-stored-in-insecure-location)).\n- Con: The extra \"ping\" requests for a dApp to periodically check the session's validity are an extra burden on the server, which can lead to a higher chance of the server being overwhelmed ([THREAT-010](../threat-model/01-threats.md#threat-010-wallet-connection-server-overwhelmed-by-too-many-requests-or-requests-that-are-too-large)).\n- Con: Vulnerable to a Man-in-the-Middle (MitM) attack ([THREAT-009](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server)) that is [common to Diffie-Hellman (DH) protocols](https://asecuritysite.com/dh/diffie_crack) where a malicious actor generates two sets of key pairs to intercept dApp requests and server responses by doing DH key exchanges with both of them.\n\n### Iteration 1\n\nThis is the first attempt at designing the dApp connect protocol, so it is the simplest one.\n\n#### Iteration 1: Establishing a Session\n\nTo be able to authenticate itself to the server, the dApp must obtain a session shared secret key key by establishing a session with the server.\n\n1. DApp: Generate dApp key pair (dApp ID & dApp secret key)\n2. DApp → Server: Send request to `/session/init`, providing dApp ID and dApp data (dApp name, icon, etc.)\n3. Server: Validate received dApp ID and information\n4. Server → User: *(Through the UI)* Present dApp data and ask for approval of connection to dApp\n5. User → Server: Approve the connection to dApp (by entering password) and send approval\n6. Server: Generate session key pair (session ID & session secret key) and session data (date created, expiration, etc.)\n7. Server: Derive the shared secret key using dApp ID and session key using <AdrLink slug=\"20250611-use-ecdh-for-establishing-dapp-connect-shared-key\" status=\"accepted\" title=\"Use ECDH for Establishing DApp Connect Shared Secret Key\" customLabel=\"ECDH\" />\n8. Server: Store session ID, shared key, session data, dApp ID and dApp data into an encrypted database file protected by the user's password\n9. Server → DApp: Respond with session ID and session data\n10. DApp: Derive the shared key using dApp key and session ID using ECDH\n11. DApp: Store session ID, session data and shared key\n\nResult: The dApp can now use the session shared key to send authenticated requests to the server.\n\n#### Iteration 1: Authenticated Request\n\nCertain requests require the dApp to be authenticated.\n\n1. DApp: Use the Hawk authentication scheme to create Hawk header data using session ID and shared secret key\n2. DApp → Server: Place the Hawk header data into the request `Authorization` header and send request\n3. Server: Verify the authentication of the dApp using the shared key according to the Hawk authentication scheme\n4. Server: Do some stuff\n5. Server → DApp: Send response\n\nResult: The dApp gets the data it needed from the server.\n\n#### Iteration 1: End session from DApp\n\nThe dApp can end the session before the session expires.\n\n1. DApp → Server: Send authenticated request to `/session/end`\n2. Server: Verify authentication\n3. Server: Delete session data from session database\n4. Server → DApp: Respond with HTTP success code (maybe `200 OK` or `204 No Content`)\n5. DApp: Delete stored session data (session ID, shared key, etc.)\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-1-establishing-a-session).\n\n#### Iteration 1: End Session from Wallet\n\nThe user, through the UI, can command the server to end the session before it expires.\n\n1. UI → Server: Command to end session\n2. Server: Delete session data from session database\n3. Server → UI: Respond with success\n\nResult: The dApp cannot successfully send authenticated requests to the server without [establishing a new session](#iteration-1-establishing-a-session).\n\n#### Iteration 1: Renew Session\n\nBefore the session is expired, a dApp can \"renew\" its session to continue being connected to the wallet after the (old) session expiration.\n\n1. DApp → Server: Send authenticated request to `/session/renew`\n2. Server: Verify authentication\n3. Server: Check session is not expired\n4. Server: Discard old session data, and create new session key pair and session data\n5. Server: Derive new session shared secret key using dApp ID and new session key using <AdrLink slug=\"20250611-use-ecdh-for-establishing-dapp-connect-shared-key\" status=\"accepted\" title=\"Use ECDH for Establishing DApp Connect Shared Secret Key\" customLabel=\"ECDH\" />\n6. Server: Store new session ID, shared key and session data\n7. Server → DApp: Respond with new session ID and session data\n8. DApp: Derive the new shared key using dApp key (unchanged) and new session ID using ECDH\n9. DApp: Store session ID, session data and shared key\n\nResult: The expiration of the session has been extended and the dApp can continue sending authenticated requests.\n\n#### Pros and Cons of Iteration 1\n\n- Pro: Less complex, which makes it easier to understand\n- Con: Vulnerable to [THREAT-022](../threat-model/01-threats.md#threat-022-multiple-dapps-establishing-connect-sessions-with-the-same-dapp-id), where two or more dApps using the same dApp ID breaks the security of the protocol\n- Con: DApp cannot properly end session if server is offline\n- Con: DApp would still show user as connected to wallet (until session expiration passes) if session was terminated from wallet\n- Con: Vulnerable to a Man-in-the-Middle (MitM) attack ([THREAT-009](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server)) that is [common to Diffie-Hellman (DH) protocols](https://asecuritysite.com/dh/diffie_crack) where a malicious actor generates two sets of key pairs to intercept dApp requests and server responses by doing DH key exchanges with both of them.\n\n## Links\n\n- Refined by <AdrLink slug=\"20250621-use-paseto-for-security-tokens\" status=\"draft\" title=\"Use PASETO for Security Tokens\" customLabel=\"Use PASETO for Security Tokens\" />\n- Relates to <AdrLink slug=\"20250621-vocab-for-dapp-connect\" status=\"accepted\" title=\"Vocabulary for DApp Connect\" customLabel=\"Vocabulary for DApp Connect\" />\n- Relates to [Use \\\"DApp Connect\\\" Term for Wallet-DApp Connection](20250608-use-dapp-connect-term-for-wallet-dapp-connection.md)\n- Relates to <AdrLink slug=\"20250611-use-ecdh-for-establishing-dapp-connect-shared-key\" status=\"accepted\" title=\"Use ECDH for Establishing DApp Connect Shared Secret Key\" customLabel=\"Use ECDH for Establishing session shared Secret Key\" />\n- Relates to <AdrLink slug=\"20240821-use-hawk-for-dapp-connection-authentication-and-authorization\" status=\"accepted\" title=\"Use Hawk for DApp Connection Authentication and Authorization\" customLabel=\"Use Hawk for DApp Connection Authentication and Authorization\" />\n- Relates to <AdrLink slug=\"20240102-use-local-server-to-connect-to-dapps\" status=\"accepted\" title=\"Use Local Server to Connect to DApps\" customLabel=\"Use Local Server to Connect to DApps\" />\n- [List of threats for this project](../threat-model/01-threats.md)\n- [Hawk API](https://github.com/mozilla/hawk/blob/main/API.md)\n- [Diffie-Hellman (Man-in-the-middle) - Asecuritysite.com](https://asecuritysite.com/dh/diffie_crack)\n- [Platform-Agnostic SEcurity TOkens (PASETO)](https://paseto.io/)\n- [Stop using JWT for sessions - joepie91's Ramblings](http://cryto.net/~joepie91/blog/2016/06/13/stop-using-jwt-for-sessions/)\n- [Stop using JWT for sessions, part 2: Why your solution doesn't work - joepie91's Ramblings](http://cryto.net/~joepie91/blog/2016/06/19/stop-using-jwt-for-sessions-part-2-why-your-solution-doesnt-work/)\n"},"creationDate":"2025-06-20T04:13:20.000Z","lastEditDate":"2025-06-22T11:12:18.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2025-06-20T06:59:59.000Z","file":{"relativePath":"docs/decisions/20250619-dapp-connect-protocol.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20250619-dapp-connect-protocol.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20250619-dapp-connect-protocol.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}