{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20240102-use-local-server-to-connect-to-dapps","package":null,"title":"Use Local Server to Connect to DApps","status":"accepted","supersededBy":null,"tags":["backend","wallet-connection"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nThe Algorand desktop wallet needs a way to interact with DApps (**D**ecentralized **Apps**) to be useful. In Algorand, the one of the main reasons for using wallet software is to connect to DApps.\n\n## Decision Drivers\n\n- **Protection of user keys:** Connected DApps must not be able to access the user's wallet keys. An unauthorized third-party must not be able to access the user's keys.\n- **Spoofing and fraud prevention:** An unauthorized third-party should not be able to intercept communications and present themselves as something or someone they are not\n- **Stability of connection between DApp and wallet app:** The connection should be reliable for the DApp and the wallet app to communicate\n- **Difficulty for DApps to integrate:** Prefer a method that makes it easy for DApps to connect to the wallet app\n- **User privacy:** User's information should not be sent to the DApp or some third-party. All communications should be contained within the user's machine.\n- **Reasonable usage of computer resources:** Must not consume an \"unreasonable\" amount of the user's computing resources (RAM, storage space, CPU, etc.). The exact definition of \"unreasonable\" has yet to be determined.\n\n## Considered Options\n\n- Local server REST API\n- WalletConnect\n- A \"DApp store\"\n- Just don't try\n\n## Decision Outcome\n\nChose to use a local server REST API because it should not consume much of the user's computing resources while providing a stable and private connection to DApps. Additional well-known protection and security measures, such as SSL/TLS, _may_ be used.\n\n**Confidence**: Low. A local server may not be able to be secure enough. May also be an issue for users with machines that have a strict firewall.\n\n## Pros and Cons of the Options\n\n### Local Server REST API\n\nAn HTTP(S) server integrated into the wallet app that serves only on `localhost` or `127.0.0.1`, which should not be exposed to anywhere outside the user's machine. DApps in the browser or installed on the user's machine can connect and interact with this local server through REST API requests. This is a method that Algorand's Key Management Daemon (KMD) uses to securely connect and interact with other services (which may be DApps).\n\n- Pro: Entirely on the user's machine\n- Pro: Almost every kind of software that can connect to the internet is capable of doing REST API calls\n- Pro: HTTP(S) server connections tend to be reliable and widely supported\n- Con: Firewall on user's machine may cause problems\n- Con: May not be secure enough, especially in the scenario where malicious software is installed on the user's machine\n- Con: Requires the development and maintenance of a library for DApps to easily connect and interact with the local server.\n\n### WalletConnect\n\nWalletConnect is the most widespread method for wallets to connect to DApps.\n\n- Pro: The most well-established method for connecting to wallets\n- Pro: If there is a way to integrate into a desktop app, it should require only a little time and effort to get working\n- Con: There seems to be no support for connecting to a wallet that is not a mobile wallet\n- Con: Connection is managed a third-party closed-source system\n- Con: There have been complaints about WalletConnect connections not being reliable\n\n### DApp store\n\nA type of \"app store\" for DApps, which would be integrated into the desktop wallet app. This would be like MyEtherWallet's \"DApps Center\" where MyEtherWallet only interacts with a list of registered DApps.\n\n- Pro: Could provide a nice experience for the user\n- Con: Would take a large amount of time and effort to build and maintain\n- Con: DApp developers would most likely be unwilling spend the time and effort to integrate their DApps into the desktop wallet app\n\n### Just don't try\n\nDo not bother trying to get the desktop wallet to interact with DApps. The desktop wallet would only be for storing keys and looking up the statuses of wallet accounts. Many desktop wallets go with this option.\n\n- Pro: Easiest and most secure option\n- Con: If the wallet app cannot connect to DApps, it is not very useful\n\n## Links\n\n- Relates to <AdrLink slug=\"20250619-dapp-connect-protocol\" status=\"accepted\" title=\"DApp Connect Protocol\" customLabel=\"DApp Connect Protocol\" />\n- Relates to <AdrLink slug=\"20231231-build-algorand-desktop-wallet-from-scratch\" status=\"superseded\" title=\"Build Algorand Desktop Wallet From Scratch\" customLabel=\"Build Algorand Desktop Wallet From Scratch\" />\n- Relates to [Use \\\"DApp\\\" in Prose and \\\"Dapp\\\" in Code](20250608-use-dapp-in-prose-and-dapp-in-code.md)\n- [KMD REST API](https://developer.algorand.org/docs/rest-apis/kmd/)\n- [WalletConnect](https://walletconnect.com/)\n- [How DApps work with MyEtherWallet](https://www.myetherwallet.com/how-it-works#dapps)\n"},"creationDate":"2024-01-03T06:20:39.000Z","lastEditDate":"2025-06-20T04:13:20.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-01-03T07:59:59.000Z","file":{"relativePath":"docs/decisions/20240102-use-local-server-to-connect-to-dapps.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20240102-use-local-server-to-connect-to-dapps.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20240102-use-local-server-to-connect-to-dapps.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}