{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20240821-use-hawk-for-dapp-connection-authentication-and-authorization","package":null,"title":"Use Hawk for DApp Connection Authentication and Authorization","status":"accepted","supersededBy":null,"tags":["wallet-connection","security"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nFor the <AdrLink slug=\"20240102-use-local-server-to-connect-to-dapps\" status=\"accepted\" title=\"Use Local Server to Connect to DApps\" customLabel=\"dApp connection server\" />, which authentication or authorization scheme should be used?\n\n## Decision Drivers\n\n- **Security:** The authentication/authorization solution should mitigate security threats [THREAT-001: Impersonation of a trustworthy dApp or platform](../threat-model/01-threats.md#threat-001-impersonation-of-a-trustworthy-dapp-or-platform) and [THREAT-009: Interception of HTTP communication between dApp and wallet connection server](../threat-model/01-threats.md#threat-009-interception-of-http-communication-between-dapp-and-wallet-connection-server).\n- **Ability to be used for localhost:** Localhost does not behave exactly like a normal web server connection. One of the most notable differences is the efficacy of using SSL/TLS. Using SSL/TLS on localhost is largely useless.\n- **DApp developer experience:** DApps come in a variety of shapes and sizes, and not all of them may be web-based in a web browser. The goal is to maintain a satisfying developer experience for dApps of all kinds when using this desktop wallet. This means making the integration of the desktop wallet as simple and easy as possible for as many platforms as possible.\n- **Flexibility:** Allow for software other than a browser to connect to and use the wallet. Also allow for the dApp connection server to separated from local user's computer and placed into a global web server.\n\n## Considered Options\n\n- Hawk\n- API key\n- OAuth 2.0\n- Cookie\n- Nothing\n\n## Decision Outcome\n\nChose Hawk. Hawk is a solution that in somewhere between OAuth 2.0 and API key authentication. It has most of the powerful features that OAuth 2.0 has with the straightforwardness of API key authentication.\n\n**Confidence:** Very low. Using Hawk may be overkill and not very effective for an HTTP connection that is on localhost. It is also possible that Hawk is not a long-lasting solution and would not be able to adjust to the changing security landscape because of the lack of development.\n\n## Pros and Cons of the Options\n\n### Hawk\n\nHawk was designed to be an alternative to OAuth 2.0 that is easier for developers to use.\n\n- Pro: Provides straightforward and flexible schemes for authentication/authorization\n- Pro: Support using \"scopes\" that would restrict what a connected dApp is allowed to as for in the wallet\n- Con: Not very well known, so there are not that many up-to-date tools and libraries that support Hawk\n- Con: There will no further maintenance at this time because the protocol is considered \"complete\"\n\n### API Key Authentication\n\nAPI key authentication is a simple method for authentication where the dApp is given a key that it must provide to make an authenticated request.\n\n- Pro: Method used by the original KMD code, so it would be easy to implement (copy & paste)\n- Pro: Simple to understand, which makes it fairly easy to maintain\n- Con: Requires user to enter the API key into dApp. This would greatly degrade user experience, possibly to the point where it compromises security.\n\n### OAuth 2.0\n\nOAuth 2.0 is one of the most common tools for authentication/authorization. It is the mechanism used to create the \"Log in with XXX\" methods that make it easier and safer for users to log in without entering a password.\n\n- Pro: A commonly used method for authentication and authorization, so there are plenty of tools and libraries that support OAuth 2.0\n- Pro: Provides dApps with more flexibility in storing wallet connection session data\n- Pro: Support using \"scopes\" that would restrict what a connected dApp is allowed to ask for in the wallet\n- Con: Heavily relies on SSL/TLS for security, which is not ideal for a localhost connection\n- Con: Does not provide a straightforward scheme for authentication/authorization, so using a third-party authentication/authorization service is typically encouraged\n\n### Cookie\n\nUsing a cookie to store wallet connection session data. The data is stored on the server by the wallet and within the browser (in the form of a cookie) by the dApp.\n\n- Pro: A tried-and-true method that is sometimes considered more secure than \"stateless\" methods like OAuth 2.0 and API key.\n- Con: Browser only\n\n### Nothing\n\nNo authentication or authorization scheme is used. The connection between the dApp and the dApp connection server is completely unsecured.\n\n- Pro: Extremely easy to implement and maintain\n- Con: Provides no reliable way of restricting dApps in any way (e.g. permissions, length of time allowed to connect to wallet)\n\n## Links\n\n- Relates to <AdrLink slug=\"20240102-use-local-server-to-connect-to-dapps\" status=\"accepted\" title=\"Use Local Server to Connect to DApps\" customLabel=\"Use Local Server to Connect to DApps\" />\n"},"creationDate":"2024-08-22T01:49:42.000Z","lastEditDate":"2025-05-30T09:21:37.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-10-01T06:59:59.000Z","file":{"relativePath":"docs/decisions/20240821-use-hawk-for-dapp-connection-authentication-and-authorization.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20240821-use-hawk-for-dapp-connection-authentication-and-authorization.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20240821-use-hawk-for-dapp-connection-authentication-and-authorization.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}