{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20231231-build-algorand-desktop-wallet","package":null,"title":"Build Algorand Desktop Wallet","status":"accepted","supersededBy":null,"tags":[],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nThere is no easy-to-use desktop wallet, that is not a website or a browser extension, for signing transactions from decentralized apps (DApps) in Algorand that fully support most of Algorand's features.\n\n## Decision Drivers\n\n- **Security:** Website wallets and browser extension wallets are not very secure for holding a user's private keys, but they are the only wallet options for desktop that can interact with DApps in Algorand. The MyAlgo data breach of user private keys proved how insecure website wallets can be and how devastating such a breach can be.\n- **Longevity:** A website wallet can be shut down and be inaccessible to the user. While browser extension wallets typically do not have this same problem, a user could lose the ability to download and and install the extension if the extension is closed source and removed from the marketplace (like the Chrome Store).\n- **Cross-Platform:** A wallet should be able to be used by most desktop users, most of whom are using either Linux, Mac or Windows operating systems.\n- **Developer Ambition:** The developer (No-Cash-7970) has been a full-stack web developer for years and wants to try building something that is not a website.\n\n## Considered Options\n\n1. Build a desktop wallet that is not a website or browser extension from scratch\n2. Create a graphical user interface (GUI) for Algorand's Key Management Daemon (KMD)\n3. Do nothing\n\n## Decision Outcome\n\nChose to build a desktop wallet from scratch, because if built correctly, the desktop wallet from scratch would be the most secure and possibly longest-lasting solution while giving the developer a chance to build something that is not a website. However, some of KMD's designs can be used as a guide for building a desktop wallet from scratch.\n\n**Confidence:** Medium. Building a desktop wallet should be feasible with a reasonable amount of time and effort. However, despite there being some architecture design ideas to achieve the goals for the desktop app, it is unclear if those design ideas will pan out.\n\n## Pros and Cons of the Options\n\n### Build Desktop Wallet from Scratch\n\nBuild a wallet for desktop that is not a website or a browser extension. The user would download and install the desktop wallet app. The user's keys would stored only on their computer.\n\n- Pro: If built correctly, a desktop wallet that does not depend on the user's browser would be the most secure wallet option for desktop.\n- Pro: Desktop wallet app that is downloaded and installed allows the user more control over the wallet app and more privacy.\n- Pro: This would be a challenge that provides the developer an opportunity to build something potentially useful that is not a website or trivial tutorial.\n- Con: Risky. If the wallet is built insecurely, there could be a massive mess like the MyAlgo breach.\n- Con: Among the options, this requires the most time, effort, and research to do well. The ways for users to utilize Algorand's more esoteric and advanced features would have to built from scratch using an Algorand SDK.\n\n### Create a GUI for KMD\n\nCreate a GUI that get input from the user and calls KMD using that input. The GUI would serve merely as a more friendly interface for KMD.\n\n- Pro: Would be able to take advantage of KMD's security that was developed by the Algorand team with less effort.\n- Pro: Utilizing KMD would make it easier to support almost all of Algorand's features.\n- Pro: It is a challenge that provides the developer an opportunity to build something potentially useful that is not a website or trivial tutorial.\n- Con: KMD does not work very well with Windows without using Docker and the Windows Subsystem for Linux (WSL) because the Algorand node software was built for and tested on *nix operating systems (Mac and Linux). It may not be possible to get a working solution for Windows that does not require the user to download and set up Docker and WSL using this option.\n- Con: It is difficult to separate the `kmd` daemon from the [go-algorand](https://github.com/algorand/go-algorand) code base into a standalone tool that does not include unnecessary components such as `algod` and `goal`.\n\n### Do Nothing\n\nDo nothing and let the problem remain as it is. Some might say this is the smartest option.\n\n- Pro: The safest, easiest and most comfortable option. Maybe someone else more capable would develop a solution (and a possibly a better one) to the problem.\n- Con: Does not solve the problem. For some reason, no one seems to have taken up solving the problem despite there being a demand for a solution. It is possible that no one will ever try to solve this problem because it is deemed too difficult, risky and unprofitable.\n- Con: No challenge for the developer to use as an opportunity.\n\n## Links\n\n- [List of Algorand Wallets](https://developer.algorand.org/ecosystem-projects/?tags=wallets)\n- [Incident Report about the 2023 MyAlgo data breach](https://github.com/HalbornSecurity/PublicReports/blob/master/Incident%20Reports/RandLabs_MyAlgo_Wallet_Executive_Summary_Halborn%20.pdf)\n"},"creationDate":"2024-01-01T08:26:48.000Z","lastEditDate":"2024-01-02T13:33:40.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-01-02T07:59:59.000Z","file":{"relativePath":"docs/decisions/20231231-build-algorand-desktop-wallet.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20231231-build-algorand-desktop-wallet.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20231231-build-algorand-desktop-wallet.md"}},"l4bVersion":"1.0.1"},"__N_SSG":true}