{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20240101-use-wails-ui-framework","package":null,"title":"Use Wails UI Framework","status":"accepted","supersededBy":null,"tags":[],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nWhat framework(s) should be used to build the desktop wallet app's graphical user interface (GUI)?\n\n## Decision Drivers\n\n- **Ease of use:** Prefer a framework that has a short learning curve and is flexible enough to accommodate fluctuating requirements\n- **Appearance:** Must be a framework that can be used to easily make a modern and good-looking UI\n- **Feature set:** Prefer a framework with a wide array of UI elements to choose from\n- **Documentation and help:** Prefer a framework with clear documentation and an active community that can help with questions\n- **Programming Language(s):** Must be a framework that can be written in one or more of the chosen languages (Refer to: <AdrLink slug=\"20240101-build-using-go-and-typescript\" status=\"accepted\" title=\"Build Using Go and TypeScript\" customLabel=\"Build Using Go and TypeScript\" />). Prefer a framework in a single language, but a framework that is divided into a backend language and a frontend UI language is acceptable as long it allows the developer (No-Cash-7970) to use her past development experience.\n- **Cross-platform:** Must compile for Linux, Mac and Windows\n- **Free and open source:** Must be a framework where the code can be examined and the license allows for commercial use\n\n## Considered Options\n\n- Wails\n- Gio UI\n- Fyne\n- Electron\n- Tauri\n\n## Decision Outcome\n\nChose Wails because it can utilize Go's performance and cross-platform ability with the flexibility and massive number of TypeScript and JavaScript libraries and tools. Despite the less-than-stellar documentation, the community in the Wails Discord server should be able to assist with issues that may arise. In addition to Wails, Next.js will be used as the TypeScript/JavaScript because the developer is familiar with the framework.\n\n**Confidence**: Medium. It is not clear if using Wails will help produce the desired results within a reasonable amount of time.\n\n## Pros and Cons of the Options\n\n### Wails\n\nWails is a desktop app framework for building with Go and web technologies (HTML, Javascript/TypeScript, CSS). According to its documentation it is a \"lightweight and fast Electron alternative for Go.\"\n\nWebsite: <https://wails.io/>\n\n- Pro: The developer can utilize her knowledge in frontend web development to build a good-looking modern UI\n- Pro: Utilizes Go, which a language with a lower learning curve that offers great cross-platform support\n- Pro: There is an active Discord server with helpful people who can answer questions\n- Pro: Free and open source under MIT license\n- Con: The documentation is messy and many things are not explained clearly.\n- Con: Many of the tutorials available are outdated and not very useful\n- Con: Some useful features, such as notifications, are not yet supported.\n\n### Gio UI\n\nGio is a cross-platform UI library for Go. It is the most popular option for desktop apps written in Go.\n\nWebsite: <https://gioui.org/>\n\n- Pro: Supports a large number of platforms, including WebAssembly\n- Pro: Free and open source under MIT and Unlicense licenses\n- Pro: Well documented with plenty of tutorials\n- Pro: UI elements are good-looking and modern\n- Con: Has a larger learning curve because of its architecture (e.g. \"immediate mode\", “retained mode”)\n- Con: Seems somewhat inflexible\n\n### Fyne\n\nFyne is a toolkit for developing native desktop apps in Go. It is one of the more popular options for developing desktop apps in Go.\n\nWebsite: <https://fyne.io/>\n\n- Pro: The learning curve is moderate\n- Pro: UI elements are good-looking and modern\n- Pro: Well documented\n- Pro: Free and open source under BSD 3-Clause License\n- Pro: Cross-platform, including support for mobile\n- Con: The appearance of the UI elements seems to be inflexible, which results in most of the apps using Fyne looking similar\n\n### Electron\n\nElectron is a massively popular framework for building desktop apps using web technologies.\n\nWebsite: <https://www.electronjs.org/>\n\n- Pro: The developer can utilize her knowledge in frontend web development to build a good-looking modern UI\n- Pro: Plenty of documentation that is clear and well-organized, as well as plenty of tutorials\n- Pro: Designed to be cross-platform\n- Pro: Free and open source under MIT license\n- Con: Many complaints about apps built with Electron consuming a lot of computing resources.\n\n### Tauri\n\nTauri is a framework for building performant and secure desktop apps with Rust and web technologies\n\nWebsite: <https://tauri.app/>\n\n- Pro: The developer can utilize her knowledge in frontend web development to build a good-looking modern UI\n- Pro: Has great cross-platform support\n- Pro: Many features and UI elements\n- Pro: Free and open source under MIT license\n- Pro: Emphasis on security, which is important for a desktop wallet\n- Pro: Plenty of documentation that is clear and well-organized\n- Con: Uses Rust as the backend. Rust has a steep learning curve that may require months to overcome.\n\n## Links\n\n- Relates to <AdrLink slug=\"20240101-build-using-go-and-typescript\" status=\"accepted\" title=\"Build Using Go and TypeScript\" customLabel=\"Build Using Go and TypeScript\" />\n- [Answer to \"Comparison with wails\" GitHub discussion](https://github.com/tauri-apps/tauri/discussions/3521#discussioncomment-3472966)\n- [Comparison of web-to-desktop frameworks](https://github.com/Elanis/web-to-desktop-framework-comparison)\n"},"creationDate":"2024-01-02T11:24:57.000Z","lastEditDate":"2024-01-03T02:13:47.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-01-03T07:59:59.000Z","file":{"relativePath":"docs/decisions/20240101-use-wails-ui-framework.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20240101-use-wails-ui-framework.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20240101-use-wails-ui-framework.md"}},"l4bVersion":"1.0.1"},"__N_SSG":true}