{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20260114-create-typescript-and-python-sdks","package":null,"title":"Create Typescript and Python SDKs","status":"accepted","supersededBy":null,"tags":["dapp-connect"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nA dApp needs to connect to the desktop wallet and manage its connect sessions with the wallet. A software development kit (SDK) would make it easier for dApp developers to use the desktop wallet in their projects. Ideally, a developer would use the SDK in the programming language they are using to develop their dApp. However, it is not possible to create an SDK for every language. A decision needs to be made on how many SDKs to create and which programming languages to create an SDK for.\n\n## Decision Drivers\n\n- **Typical use of the language**: Most languages have a wide range of uses. However, in practice, a language's use is typically far narrower than what it is capable of. For example, JavaScript and TypeScript are most frequently used for font-end web development, Python is frequently used for data analysis, and Go is frequently used for back-end web development.\n- **Popularity of the language**: How many developers use the language? It is more worthwhile to create an SDK for a language that many developers use.\n- **Developer's familiarity with the language**: The developer of this project (No-Cash-7970) will not create an SDK for a programming language she is not familiar with\n- **Developer time and resources**: The developer has limited time and resources for creating and maintaining SDKs. At most 3 SDKs can be created.\n\n## Considered Options\n\n- TypeScript\n- Python\n- Go\n\n## Decision Outcome\n\nChose to create only 2 SDKs: TypeScript and Python. Typescript and Python are among the most popular languages and the developer (No-Cash-7970) has some familiarity with both languages. These two languages are enough to test and demonstrate how a both web-based dApps and non-web-based dApps can connect to and use the desktop wallet.\n\n**Confidence**: High. The Typescript and Python SDKs have been implemented. However, no example dApps have been created for either SDK.\n\n## Pros and Cons of the Options\n\n### TypeScript\n\nTypescript is a very popular language for front-end web development. An SDK for TypeScript can also be used for plain JavaScript as well.\n\n- Pro: Most dApps are web based and written in TypeScript or JavaScript\n- Pro: Typescript can be compiled into Javascript that can be run in any modern web browser\n\n### Python\n\nPython is a very popular multipurpose language that is considered to be friendly for those learning to program.\n\n- Pro: Often used for creating scripts and applications that run in the terminal\n- Pro: The developer wants a project for practicing her Python\n- Con: Not often used for building applications that have a GUI (graphical user interface)\n\n### Go\n\nGo is a common programming language used for a variety of high-performance applications. The back-end for the desktop wallet is written in Go.\n\n- Pro: Go applications are often performant because of the built-in support for concurrency\n- Con: While Go applications can be compiled for a wide range of machines and environments, it is still limited and a few issues can arise on certain machines\n"},"creationDate":"2026-01-15T05:15:25.000Z","lastEditDate":"2026-01-16T04:02:56.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2026-01-16T07:59:59.000Z","file":{"relativePath":"docs/decisions/20260114-create-typescript-and-python-sdks.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20260114-create-typescript-and-python-sdks.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20260114-create-typescript-and-python-sdks.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}