{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20240602-deprioritize-ui-design-and-ux","package":null,"title":"Deprioritize UI Design and UX","status":"accepted","supersededBy":null,"tags":["roadmap"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nThe desktop wallet is a prototype that will eventually be cast aside or thrown away after getting enough useful information. Most good wallets have so many features and components that they require a team of developers to build and manage them. Unfortunately, only one part-time developer is available to build this desktop wallet prototype. This makes the amount of developer time and effort available for building this project very limited. That precious developer time and effort needs to go to the features and components of the desktop wallet that will yield the most results in the shortest amount of time possible.\n\n## Decision Drivers\n\n- **Developer time and effort**: The amount of time and effort available for development is very limited\n- **Only the basic features are necessary**: There are many features that users in wallet software. However, most of these features are not needed to build a prototype that yields insightful results.\n\n## Decision Outcome\n\nChose to make user interface (UI) design and user experience (UX) low priorities. Getting the UI and UX right takes a lot of time and effort. This time and effort is better spent on building the basic features. Although the quality of the UI and UX will likely suffer significantly, it should not get in the way of assessing the security and technical feasibility of desktop wallet prototype.\n\n**Confidence:** High\n\n### Positive Consequences\n\n- More development time and effort can go to the experimentation of critical security and technical components\n\n### Negative Consequences\n\n- The UI would probably not look good\n- The UI may be difficult for many users\n- It is possible for the UI to be so terrible that it undermines security and usefulness of features\n\n## Links\n\n- Relates to <AdrLink slug=\"20231231-build-algorand-desktop-wallet\" status=\"accepted\" title=\"Build Algorand Desktop Wallet\" customLabel=\"Build Algorand Desktop Wallet\" />\n"},"creationDate":"2024-06-03T07:59:55.000Z","lastEditDate":"2024-07-16T02:22:06.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-06-06T06:59:59.000Z","file":{"relativePath":"docs/decisions/20240602-deprioritize-ui-design-and-ux.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20240602-deprioritize-ui-design-and-ux.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20240602-deprioritize-ui-design-and-ux.md"}},"l4bVersion":"1.0.1"},"__N_SSG":true}