{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20240101-build-using-go-and-typescript","package":null,"title":"Build Using Go and TypeScript","status":"accepted","supersededBy":null,"tags":[],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nWhich programming language(s) should be used to implement the Algorand wallet for desktop? May need to use multiple languages.\n\n## Decision Drivers\n\n- **Available help and documentation:** Prefer a language where there is plenty of documentation and a large community to go to for help\n- **Free and open source tools and libraries:** Prefer a language where there are libraries and tools for building a production-ready desktop graphical user interface (GUI) while providing as much flexibility as possible\n- **Easy to build for multiple platforms:** Prefer a language that can be used to build for as many computer platforms and operating systems as possible, especially Linux, Mac and Windows\n- **Amount of time needed to learn:** Prefer a language that does not need a large amount of time (2 weeks or more) to be proficient enough to build a functioning and modern-looking desktop app\n- **Developer's familiarity with other languages:** Prefer to use languages that the developer (No-Cash-7970) is familiar with (besides Go) like TypeScript, Python, and PHP\n- **Developer's interests:** The developer wants to learn Go and make something with it because Go is becoming one of the most popular languages\n\n## Considered Options\n\n- Go\n- TypeScript/JavaScript\n- Rust\n- Python\n\n## Decision Outcome\n\nChose to use Go with TypeScript/JavaScript because Go is an easy-to-learn language that can be easily compiled for the multiple operating systems. With [Wails](https://wails.io/), the flexibility of JavaScript and TypeScript can be utilized to build a user interface (UI) for a backend built in Go that can better utilize computing resources in a manner that looks native to the user's operating system.\n\n**Confidence**: Medium. It is not clear if the Go and TypeScript/JavaScript combination will allow for the desired results.\n\n## Pros and Cons of the Options\n\n### Go\n\n- Pro: Developer wants to learn it\n- Pro: Easy to get started\n- Pro: Cross-platform support by default\n- Pro: Popular language with many libraries, tools and tutorials\n- Pro: May be able to borrow code from Algorand's Key Management Daemon (KMD)\n- Con: Will take some time to learn\n- Con: Not commonly known for being used to develop desktop apps\n\n### TypeScript/JavaScript\n\n- Pro: Developer is proficient in using JavaScript and TypeScript\n- Pro: Cross-platform, with a browser or Node.js\n- Con: Pure TypeScript/JavaScript framework options for building cross-platform desktop apps, like [Electron](https://www.electronjs.org/), tend to be resource hogs because they embed a full browser\n\n### Rust\n\n- Pro: It is a performant language\n- Pro: Cross-platform by default\n- Con: Requires a lot of time to learn proficiently (at least a month)\n- Con: Number of tools and libraries are limited, although the community and the tooling is growing\n- Con: Developer doesn't care to learn it\n\n### Python\n\n- Pro: Developer is familiar with Python\n- Con: Difficult to cross-compile\n\n## Links\n\n- Relates to <AdrLink slug=\"20240101-use-wails-ui-framework\" status=\"accepted\" title=\"Use Wails UI Framework\" customLabel=\"Use Wails UI Framework\" />\n"},"creationDate":"2024-01-02T07:18:47.000Z","lastEditDate":"2024-01-04T21:19:02.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-01-03T07:59:59.000Z","file":{"relativePath":"docs/decisions/20240101-build-using-go-and-typescript.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20240101-build-using-go-and-typescript.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20240101-build-using-go-and-typescript.md"}},"l4bVersion":"1.0.1"},"__N_SSG":true}