{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20240218-create-and-maintain-c4-diagrams","package":null,"title":"Create and Maintain C4 Diagrams","status":"accepted","supersededBy":null,"tags":["dev-tools","dev-process","docs"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nThe software architecture of the <AdrLink slug=\"20231231-build-algorand-desktop-wallet-from-scratch\" status=\"superseded\" title=\"Build Algorand Desktop Wallet From Scratch\" customLabel=\"desktop wallet\" /> may be unusual and difficult to understand. Communicating the architecture in a manner that is easier to understand is key to making it easier for anyone to understand the system and provide useful input.\n\n## Decision Drivers\n\n- **Understandability:** The top level (system view) diagram should be able to be understood by people who have little or no software engineering knowledge. The lower-level diagrams showing more details about the software system should be descriptive enough to communicate what is happening while being able to be understood by those with software engineering knowledge but with little or no knowledge about this project specifically.\n- **Ease of modifying and updating diagrams:** The diagrams should be able to be easily updated as the system changes\n- **Ability to sufficiently represent the system at multiple levels:** The diagrams should be able to represent multiple parts of the system at varying levels of abstraction (from system level to class component level)\n\n## Considered Options\n\n- UML (Unified Modeling Language)\n- C4 (Context, Containers, Components, Code)\n\n## Decision Outcome\n\nChose to use C4 diagrams to represent the software architecture. This decision comes after trying C4 diagrams out using [Structurizr](https://structurizr.com/dsl). The diagrams should be updated as the system changes. Their visual graphic form should be accessible to the public.\n\n**Confidence**: (2026-01-14) Medium-High. The diagrams were useful a few times when implementing the backend for the dApp connect API, but it is still unclear whether the extra time and effort required is worth it.\n\n~~**Confidence**: Medium. Creating and maintaining the diagrams should be useful, but it is not clear if the extra time and effort required is worth it.~~\n\n### Positive Consequences\n\n- More transparency through better communication of how the desktop wallet works\n- Can be a great help when designing the software architecture\n- Can help with threat modeling\n\n### Negative Consequences\n\n- More stuff to create and maintain, which takes away time and effort that can go to building and maintaining the software\n\n## Pros and Cons of the Options\n\n### UML\n\nThe Unified Modeling Language (UML) has been around for decades. It is a huge and flexible modeling language has been used frequently by a variety of projects over the years. However, the use of UML has declined in recent years in favor of more lightweight (and perhaps less organized) methods of diagraming systems which has resulted in newer developers not being familiar with UML.\n\n- Pro: Has many options and tools because of being well-established in software engineering\n- Con: UML diagrams can be clunky or contain too many details that make them difficult to read and understand\n\n### C4\n\nC4 is a lightweight modeling system for software architecture with 4 levels of abstraction: Context, Containers, Components, and Code. It was created in 2006, which makes it fairly new to the software engineering world.\n\n- Pro: C4 diagrams tend to be simpler to read and understand than UML\n- Pro: The diagrams can be specified in a text files and committed to a Git repository\n- Pro: Can be combined with UML for more detailed diagrams\n- Con: Not as many tools for it because it is not a very well-known modeling system\n\n## Links\n\n- [Unified Modeling Language - Wikipedia](https://en.wikipedia.org/wiki/Unified_Modeling_Language)\n- [C4 model - Wikipedia](https://en.wikipedia.org/wiki/C4_model)\n- [The C4 model for visualising software architecture](https://c4model.com/)\n"},"creationDate":"2024-02-20T05:04:31.000Z","lastEditDate":"2026-01-15T05:48:56.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2024-02-21T07:59:59.000Z","file":{"relativePath":"docs/decisions/20240218-create-and-maintain-c4-diagrams.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20240218-create-and-maintain-c4-diagrams.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20240218-create-and-maintain-c4-diagrams.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}