{"pageProps":{"projectName":"duckySigner","currentAdr":{"slug":"20250608-use-dapp-in-prose-and-dapp-in-code","package":null,"title":"Use \"DApp\" in Prose and \"Dapp\" in Code","status":"accepted","supersededBy":null,"tags":["dev-process","docs"],"deciders":["No-Cash-7970"],"body":{"enhancedMdx":"\n## Context and Problem Statement\n\nThe term \"decentralized application\" is commonly abbreviated using into \"dApp\" (with uppercase A) or \"dapp\" (with lowercase A). The inconsistent capitalization of \"dApp\" within this project's codebase is irritating.\n\n## Decision Drivers\n\n- **Existing conventions:** How is the term capitalized elsewhere? Being consistent with how the term is commonly written helps make both documentation and code easier to read.\n- **Readability in code:** Whichever form is used, it needs to be easily read when stuck into variable names\n\n## Considered Options\n\n- dApp/DApp (with uppercase A)\n- dapp/Dapp (with lowercase A)\n\n## Decision Outcome\n\nChose to use \"dApp\" (with uppercase A) in documentation or other types of prose, and \"dapp\" (with lowercase A) in code or filenames. The first letter in with both forms will be capitalized according to English capitalization rules or code style like any other English word.\n\n**Confidence:** Very high\n\n## Pros and Cons of the Options\n\n### DApp (With Uppercase A)\n\nWikipedia always uses \"DApp\" (with uppercase D and uppercase A) and never \"dApp\" (with lowercase D and uppercase A). On the other hand, most publications, like Investopedia, use the form with lowercase D and uppercase A unless the word is at the beginning of a sentence.\n\n- Pro: More obvious that it is an abbreviation for something\n- Pro: More common in formal writing (e.g. research papers, news articles)\n- Con: Not consistent with standard English rules of capitalization\n- Con: Can cause some awkward-looking variable names in code\n\n### Dapp (With Lowercase A)\n\nPublications from the Ethereum Foundation use the all-lowercase form. This form capitalized like a typical English word.\n\n- Pro: Consistent with the way English words are typically capitalized\n- Pro: Used by the organization that coined the term (Ethereum Foundation)\n- Pro: May become the most common form in the future\n- Con: Not typically used in formal writing (e.g. research papers, news articles)\n- Con: The way it looks obscures that it is an abbreviation\n\n## Links\n\n- [Wikipedia page for \"DApp\"](https://en.wikipedia.org/wiki/Decentralized_application)\n- [Ethereum page about \"dapps\"](https://ethereum.org/en/dapps/)\n- [Investopedia page about \"dApps\"](https://www.investopedia.com/terms/d/decentralized-applications-dapps.asp)\n"},"creationDate":"2025-06-08T21:16:56.000Z","lastEditDate":"2025-06-09T11:28:24.000Z","lastEditAuthor":"No-Cash-7970","publicationDate":"2025-06-10T06:59:59.000Z","file":{"relativePath":"docs/decisions/20250608-use-dapp-in-prose-and-dapp-in-code.md","absolutePath":"/home/runner/work/duckySigner/duckySigner/docs/decisions/20250608-use-dapp-in-prose-and-dapp-in-code.md"},"repository":{"provider":"github","viewUrl":"https://github.com/No-Cash-7970/duckySigner/blob/master/docs/decisions/20250608-use-dapp-in-prose-and-dapp-in-code.md"}},"l4bVersion":"1.1.0"},"__N_SSG":true}